podonoghue/T962a_Oven_Controller/Software/SMT_Oven_RTOS/Project_Headers/MK22DN512M5.h
/**
* @addtogroup TPIU_Register_Masks_GROUP TPIU Register Masks
* @brief Register Masks for TPIU
* @{
*/
/* ------- SSPSR Bit Fields                         ------ */
#define TPIU_SSPSR_SWIDTH_MASK                   (0xFFFFFFFFU)                                       /*!< TPIU_SSPSR.SWIDTH Mask                  */
#define TPIU_SSPSR_SWIDTH_SHIFT                  (0U)                                                /*!< TPIU_SSPSR.SWIDTH Position              */
#define TPIU_SSPSR_SWIDTH(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< TPIU_SSPSR.SWIDTH Field                 */
/* ------- CSPSR Bit Fields                         ------ */
#define TPIU_CSPSR_CWIDTH_MASK                   (0xFFFFFFFFU)                                       /*!< TPIU_CSPSR.CWIDTH Mask                  */
#define TPIU_CSPSR_CWIDTH_SHIFT                  (0U)                                                /*!< TPIU_CSPSR.CWIDTH Position              */
#define TPIU_CSPSR_CWIDTH(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< TPIU_CSPSR.CWIDTH Field                 */
/* ------- ACPR Bit Fields                          ------ */
#define TPIU_ACPR_PRESCALER_MASK                 (0x1FFFU)                                           /*!< TPIU_ACPR.PRESCALER Mask                */
#define TPIU_ACPR_PRESCALER_SHIFT                (0U)                                                /*!< TPIU_ACPR.PRESCALER Position            */
#define TPIU_ACPR_PRESCALER(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x1FFFUL)        /*!< TPIU_ACPR.PRESCALER Field               */
/* ------- SPPR Bit Fields                          ------ */
#define TPIU_SPPR_TXMODE_MASK                    (0x3U)                                              /*!< TPIU_SPPR.TXMODE Mask                   */
#define TPIU_SPPR_TXMODE_SHIFT                   (0U)                                                /*!< TPIU_SPPR.TXMODE Position               */
#define TPIU_SPPR_TXMODE(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< TPIU_SPPR.TXMODE Field                  */
/* ------- FFSR Bit Fields                          ------ */
#define TPIU_FFSR_F1InProg_MASK                  (0x1U)                                              /*!< TPIU_FFSR.F1InProg Mask                 */
#define TPIU_FFSR_F1InProg_SHIFT                 (0U)                                                /*!< TPIU_FFSR.F1InProg Position             */
#define TPIU_FFSR_F1InProg(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< TPIU_FFSR.F1InProg Field                */
#define TPIU_FFSR_FtStopped_MASK                 (0x2U)                                              /*!< TPIU_FFSR.FtStopped Mask                */
#define TPIU_FFSR_FtStopped_SHIFT                (1U)                                                /*!< TPIU_FFSR.FtStopped Position            */
#define TPIU_FFSR_FtStopped(x)                   (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< TPIU_FFSR.FtStopped Field               */
#define TPIU_FFSR_TCPresent_MASK                 (0x4U)                                              /*!< TPIU_FFSR.TCPresent Mask                */
#define TPIU_FFSR_TCPresent_SHIFT                (2U)                                                /*!< TPIU_FFSR.TCPresent Position            */
#define TPIU_FFSR_TCPresent(x)                   (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< TPIU_FFSR.TCPresent Field               */
#define TPIU_FFSR_FtNonStop_MASK                 (0x8U)                                              /*!< TPIU_FFSR.FtNonStop Mask                */
#define TPIU_FFSR_FtNonStop_SHIFT                (3U)                                                /*!< TPIU_FFSR.FtNonStop Position            */
#define TPIU_FFSR_FtNonStop(x)                   (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< TPIU_FFSR.FtNonStop Field               */
/* ------- FFCR Bit Fields                          ------ */
#define TPIU_FFCR_EnFCont_MASK                   (0x2U)                                              /*!< TPIU_FFCR.EnFCont Mask                  */
#define TPIU_FFCR_EnFCont_SHIFT                  (1U)                                                /*!< TPIU_FFCR.EnFCont Position              */
#define TPIU_FFCR_EnFCont(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< TPIU_FFCR.EnFCont Field                 */
#define TPIU_FFCR_TrigIn_MASK                    (0x100U)                                            /*!< TPIU_FFCR.TrigIn Mask                   */
#define TPIU_FFCR_TrigIn_SHIFT                   (8U)                                                /*!< TPIU_FFCR.TrigIn Position               */
#define TPIU_FFCR_TrigIn(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< TPIU_FFCR.TrigIn Field                  */
/* ------- FSCR Bit Fields                          ------ */
#define TPIU_FSCR_CycCount_MASK                  (0xFFFU)                                            /*!< TPIU_FSCR.CycCount Mask                 */
#define TPIU_FSCR_CycCount_SHIFT                 (0U)                                                /*!< TPIU_FSCR.CycCount Position             */
#define TPIU_FSCR_CycCount(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFUL)         /*!< TPIU_FSCR.CycCount Field                */
/* ------- TRIGGER Bit Fields                       ------ */
#define TPIU_TRIGGER_TRIGGER_MASK                (0x1U)                                              /*!< TPIU_TRIGGER.TRIGGER Mask               */
#define TPIU_TRIGGER_TRIGGER_SHIFT               (0U)                                                /*!< TPIU_TRIGGER.TRIGGER Position           */
#define TPIU_TRIGGER_TRIGGER(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< TPIU_TRIGGER.TRIGGER Field              */
/* ------- FIFODATA0 Bit Fields                     ------ */
#define TPIU_FIFODATA0_ETMdata0_MASK             (0xFFU)                                             /*!< TPIU_FIFODATA0.ETMdata0 Mask            */
#define TPIU_FIFODATA0_ETMdata0_SHIFT            (0U)                                                /*!< TPIU_FIFODATA0.ETMdata0 Position        */
#define TPIU_FIFODATA0_ETMdata0(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< TPIU_FIFODATA0.ETMdata0 Field           */
#define TPIU_FIFODATA0_ETMdata1_MASK             (0xFF00U)                                           /*!< TPIU_FIFODATA0.ETMdata1 Mask            */
#define TPIU_FIFODATA0_ETMdata1_SHIFT            (8U)                                                /*!< TPIU_FIFODATA0.ETMdata1 Position        */
#define TPIU_FIFODATA0_ETMdata1(x)               (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< TPIU_FIFODATA0.ETMdata1 Field           */
#define TPIU_FIFODATA0_ETMdata2_MASK             (0xFF0000U)                                         /*!< TPIU_FIFODATA0.ETMdata2 Mask            */
#define TPIU_FIFODATA0_ETMdata2_SHIFT            (16U)                                               /*!< TPIU_FIFODATA0.ETMdata2 Position        */
#define TPIU_FIFODATA0_ETMdata2(x)               (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< TPIU_FIFODATA0.ETMdata2 Field           */
#define TPIU_FIFODATA0_ETMbytecount_MASK         (0x3000000U)                                        /*!< TPIU_FIFODATA0.ETMbytecount Mask        */
#define TPIU_FIFODATA0_ETMbytecount_SHIFT        (24U)                                               /*!< TPIU_FIFODATA0.ETMbytecount Position    */
#define TPIU_FIFODATA0_ETMbytecount(x)           (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< TPIU_FIFODATA0.ETMbytecount Field       */
#define TPIU_FIFODATA0_ETMATVALID_MASK           (0x4000000U)                                        /*!< TPIU_FIFODATA0.ETMATVALID Mask          */
#define TPIU_FIFODATA0_ETMATVALID_SHIFT          (26U)                                               /*!< TPIU_FIFODATA0.ETMATVALID Position      */
#define TPIU_FIFODATA0_ETMATVALID(x)             (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< TPIU_FIFODATA0.ETMATVALID Field         */
#define TPIU_FIFODATA0_ITMbytecount_MASK         (0x18000000U)                                       /*!< TPIU_FIFODATA0.ITMbytecount Mask        */
#define TPIU_FIFODATA0_ITMbytecount_SHIFT        (27U)                                               /*!< TPIU_FIFODATA0.ITMbytecount Position    */
#define TPIU_FIFODATA0_ITMbytecount(x)           (((uint32_t)(((uint32_t)(x))<<27U))&0x18000000UL)   /*!< TPIU_FIFODATA0.ITMbytecount Field       */
#define TPIU_FIFODATA0_ITMATVALID_MASK           (0x20000000U)                                       /*!< TPIU_FIFODATA0.ITMATVALID Mask          */
#define TPIU_FIFODATA0_ITMATVALID_SHIFT          (29U)                                               /*!< TPIU_FIFODATA0.ITMATVALID Position      */
#define TPIU_FIFODATA0_ITMATVALID(x)             (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< TPIU_FIFODATA0.ITMATVALID Field         */
/* ------- ITATBCTR2 Bit Fields                     ------ */
#define TPIU_ITATBCTR2_ATREADY1_ATREADY2_MASK    (0x1U)                                              /*!< TPIU_ITATBCTR2.ATREADY1_ATREADY2 Mask   */
#define TPIU_ITATBCTR2_ATREADY1_ATREADY2_SHIFT   (0U)                                                /*!< TPIU_ITATBCTR2.ATREADY1_ATREADY2 Position*/
#define TPIU_ITATBCTR2_ATREADY1_ATREADY2(x)      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< TPIU_ITATBCTR2.ATREADY1_ATREADY2 Field  */
/* ------- ITATBCTR0 Bit Fields                     ------ */
#define TPIU_ITATBCTR0_ATVALID1_ATVALID2_MASK    (0x1U)                                              /*!< TPIU_ITATBCTR0.ATVALID1_ATVALID2 Mask   */
#define TPIU_ITATBCTR0_ATVALID1_ATVALID2_SHIFT   (0U)                                                /*!< TPIU_ITATBCTR0.ATVALID1_ATVALID2 Position*/
#define TPIU_ITATBCTR0_ATVALID1_ATVALID2(x)      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< TPIU_ITATBCTR0.ATVALID1_ATVALID2 Field  */
/* ------- FIFODATA1 Bit Fields                     ------ */
#define TPIU_FIFODATA1_ITMdata0_MASK             (0xFFU)                                             /*!< TPIU_FIFODATA1.ITMdata0 Mask            */
#define TPIU_FIFODATA1_ITMdata0_SHIFT            (0U)                                                /*!< TPIU_FIFODATA1.ITMdata0 Position        */
#define TPIU_FIFODATA1_ITMdata0(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< TPIU_FIFODATA1.ITMdata0 Field           */
#define TPIU_FIFODATA1_ITMdata1_MASK             (0xFF00U)                                           /*!< TPIU_FIFODATA1.ITMdata1 Mask            */
#define TPIU_FIFODATA1_ITMdata1_SHIFT            (8U)                                                /*!< TPIU_FIFODATA1.ITMdata1 Position        */
#define TPIU_FIFODATA1_ITMdata1(x)               (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< TPIU_FIFODATA1.ITMdata1 Field           */
#define TPIU_FIFODATA1_ITMdata2_MASK             (0xFF0000U)                                         /*!< TPIU_FIFODATA1.ITMdata2 Mask            */
#define TPIU_FIFODATA1_ITMdata2_SHIFT            (16U)                                               /*!< TPIU_FIFODATA1.ITMdata2 Position        */
#define TPIU_FIFODATA1_ITMdata2(x)               (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< TPIU_FIFODATA1.ITMdata2 Field           */
#define TPIU_FIFODATA1_ETMbytecount_MASK         (0x3000000U)                                        /*!< TPIU_FIFODATA1.ETMbytecount Mask        */
#define TPIU_FIFODATA1_ETMbytecount_SHIFT        (24U)                                               /*!< TPIU_FIFODATA1.ETMbytecount Position    */
#define TPIU_FIFODATA1_ETMbytecount(x)           (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< TPIU_FIFODATA1.ETMbytecount Field       */
#define TPIU_FIFODATA1_ETMATVALID_MASK           (0x4000000U)                                        /*!< TPIU_FIFODATA1.ETMATVALID Mask          */
#define TPIU_FIFODATA1_ETMATVALID_SHIFT          (26U)                                               /*!< TPIU_FIFODATA1.ETMATVALID Position      */
#define TPIU_FIFODATA1_ETMATVALID(x)             (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< TPIU_FIFODATA1.ETMATVALID Field         */
#define TPIU_FIFODATA1_ITMbytecount_MASK         (0x18000000U)                                       /*!< TPIU_FIFODATA1.ITMbytecount Mask        */
#define TPIU_FIFODATA1_ITMbytecount_SHIFT        (27U)                                               /*!< TPIU_FIFODATA1.ITMbytecount Position    */
#define TPIU_FIFODATA1_ITMbytecount(x)           (((uint32_t)(((uint32_t)(x))<<27U))&0x18000000UL)   /*!< TPIU_FIFODATA1.ITMbytecount Field       */
#define TPIU_FIFODATA1_ITMATVALID_MASK           (0x20000000U)                                       /*!< TPIU_FIFODATA1.ITMATVALID Mask          */
#define TPIU_FIFODATA1_ITMATVALID_SHIFT          (29U)                                               /*!< TPIU_FIFODATA1.ITMATVALID Position      */
#define TPIU_FIFODATA1_ITMATVALID(x)             (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< TPIU_FIFODATA1.ITMATVALID Field         */
/* ------- ITCTRL Bit Fields                        ------ */
#define TPIU_ITCTRL_Mode_MASK                    (0x3U)                                              /*!< TPIU_ITCTRL.Mode Mask                   */
#define TPIU_ITCTRL_Mode_SHIFT                   (0U)                                                /*!< TPIU_ITCTRL.Mode Position               */
#define TPIU_ITCTRL_Mode(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< TPIU_ITCTRL.Mode Field                  */
/* ------- CLAIMSET Bit Fields                      ------ */
#define TPIU_CLAIMSET_CLAIMSET_MASK              (0xFU)                                              /*!< TPIU_CLAIMSET.CLAIMSET Mask             */
#define TPIU_CLAIMSET_CLAIMSET_SHIFT             (0U)                                                /*!< TPIU_CLAIMSET.CLAIMSET Position         */
#define TPIU_CLAIMSET_CLAIMSET(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< TPIU_CLAIMSET.CLAIMSET Field            */
/* ------- CLAIMCLR Bit Fields                      ------ */
#define TPIU_CLAIMCLR_CLAIMCLR_MASK              (0xFU)                                              /*!< TPIU_CLAIMCLR.CLAIMCLR Mask             */
#define TPIU_CLAIMCLR_CLAIMCLR_SHIFT             (0U)                                                /*!< TPIU_CLAIMCLR.CLAIMCLR Position         */
#define TPIU_CLAIMCLR_CLAIMCLR(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< TPIU_CLAIMCLR.CLAIMCLR Field            */
/* ------- DEVID Bit Fields                         ------ */
#define TPIU_DEVID_NumberOfTraceInputs_MASK      (0x1FU)                                             /*!< TPIU_DEVID.NumberOfTraceInputs Mask     */
#define TPIU_DEVID_NumberOfTraceInputs_SHIFT     (0U)                                                /*!< TPIU_DEVID.NumberOfTraceInputs Position */
#define TPIU_DEVID_NumberOfTraceInputs(x)        (((uint32_t)(((uint32_t)(x))<<0U))&0x1FUL)          /*!< TPIU_DEVID.NumberOfTraceInputs Field    */
#define TPIU_DEVID_TRACECELKIN_MASK              (0x20U)                                             /*!< TPIU_DEVID.TRACECELKIN Mask             */
#define TPIU_DEVID_TRACECELKIN_SHIFT             (5U)                                                /*!< TPIU_DEVID.TRACECELKIN Position         */
#define TPIU_DEVID_TRACECELKIN(x)                (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< TPIU_DEVID.TRACECELKIN Field            */
#define TPIU_DEVID_MinimumBufferSize_MASK        (0x1C0U)                                            /*!< TPIU_DEVID.MinimumBufferSize Mask       */
#define TPIU_DEVID_MinimumBufferSize_SHIFT       (6U)                                                /*!< TPIU_DEVID.MinimumBufferSize Position   */
#define TPIU_DEVID_MinimumBufferSize(x)          (((uint32_t)(((uint32_t)(x))<<6U))&0x1C0UL)         /*!< TPIU_DEVID.MinimumBufferSize Field      */
#define TPIU_DEVID_TraceAndClockModes_MASK       (0x200U)                                            /*!< TPIU_DEVID.TraceAndClockModes Mask      */
#define TPIU_DEVID_TraceAndClockModes_SHIFT      (9U)                                                /*!< TPIU_DEVID.TraceAndClockModes Position  */
#define TPIU_DEVID_TraceAndClockModes(x)         (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< TPIU_DEVID.TraceAndClockModes Field     */
#define TPIU_DEVID_Manchester_MASK               (0x400U)                                            /*!< TPIU_DEVID.Manchester Mask              */
#define TPIU_DEVID_Manchester_SHIFT              (10U)                                               /*!< TPIU_DEVID.Manchester Position          */
#define TPIU_DEVID_Manchester(x)                 (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< TPIU_DEVID.Manchester Field             */
#define TPIU_DEVID_NRZ_MASK                      (0x800U)                                            /*!< TPIU_DEVID.NRZ Mask                     */
#define TPIU_DEVID_NRZ_SHIFT                     (11U)                                               /*!< TPIU_DEVID.NRZ Position                 */
#define TPIU_DEVID_NRZ(x)                        (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< TPIU_DEVID.NRZ Field                    */
/* ------- PID4 Bit Fields                          ------ */
#define TPIU_PID4_JEP106_MASK                    (0xFU)                                              /*!< TPIU_PID4.JEP106 Mask                   */
#define TPIU_PID4_JEP106_SHIFT                   (0U)                                                /*!< TPIU_PID4.JEP106 Position               */
#define TPIU_PID4_JEP106(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< TPIU_PID4.JEP106 Field                  */
#define TPIU_PID4_c4KB_MASK                      (0xF0U)                                             /*!< TPIU_PID4.c4KB Mask                     */
#define TPIU_PID4_c4KB_SHIFT                     (4U)                                                /*!< TPIU_PID4.c4KB Position                 */
#define TPIU_PID4_c4KB(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< TPIU_PID4.c4KB Field                    */
/* ------- PID5 Bit Fields                          ------ */
/* ------- PID6 Bit Fields                          ------ */
/* ------- PID7 Bit Fields                          ------ */
/* ------- PID0 Bit Fields                          ------ */
#define TPIU_PID0_PartNumber_MASK                (0xFFU)                                             /*!< TPIU_PID0.PartNumber Mask               */
#define TPIU_PID0_PartNumber_SHIFT               (0U)                                                /*!< TPIU_PID0.PartNumber Position           */
#define TPIU_PID0_PartNumber(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< TPIU_PID0.PartNumber Field              */
/* ------- PID1 Bit Fields                          ------ */
#define TPIU_PID1_PartNumber_MASK                (0xFU)                                              /*!< TPIU_PID1.PartNumber Mask               */
#define TPIU_PID1_PartNumber_SHIFT               (0U)                                                /*!< TPIU_PID1.PartNumber Position           */
#define TPIU_PID1_PartNumber(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< TPIU_PID1.PartNumber Field              */
#define TPIU_PID1_JEP106_identity_code_MASK      (0xF0U)                                             /*!< TPIU_PID1.JEP106_identity_code Mask     */
#define TPIU_PID1_JEP106_identity_code_SHIFT     (4U)                                                /*!< TPIU_PID1.JEP106_identity_code Position */
#define TPIU_PID1_JEP106_identity_code(x)        (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< TPIU_PID1.JEP106_identity_code Field    */
/* ------- PID2 Bit Fields                          ------ */
#define TPIU_PID2_JEP106_identity_code_MASK      (0x7U)                                              /*!< TPIU_PID2.JEP106_identity_code Mask     */
#define TPIU_PID2_JEP106_identity_code_SHIFT     (0U)                                                /*!< TPIU_PID2.JEP106_identity_code Position */
#define TPIU_PID2_JEP106_identity_code(x)        (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< TPIU_PID2.JEP106_identity_code Field    */
#define TPIU_PID2_Revision_MASK                  (0xF0U)                                             /*!< TPIU_PID2.Revision Mask                 */
#define TPIU_PID2_Revision_SHIFT                 (4U)                                                /*!< TPIU_PID2.Revision Position             */
#define TPIU_PID2_Revision(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< TPIU_PID2.Revision Field                */
/* ------- PID3 Bit Fields                          ------ */
#define TPIU_PID3_CustomerModified_MASK          (0xFU)                                              /*!< TPIU_PID3.CustomerModified Mask         */
#define TPIU_PID3_CustomerModified_SHIFT         (0U)                                                /*!< TPIU_PID3.CustomerModified Position     */
#define TPIU_PID3_CustomerModified(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< TPIU_PID3.CustomerModified Field        */
#define TPIU_PID3_RevAnd_MASK                    (0xF0U)                                             /*!< TPIU_PID3.RevAnd Mask                   */
#define TPIU_PID3_RevAnd_SHIFT                   (4U)                                                /*!< TPIU_PID3.RevAnd Position               */
#define TPIU_PID3_RevAnd(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< TPIU_PID3.RevAnd Field                  */
/* ------- CID0 Bit Fields                          ------ */
#define TPIU_CID0_Preamble_MASK                  (0xFFU)                                             /*!< TPIU_CID0.Preamble Mask                 */
#define TPIU_CID0_Preamble_SHIFT                 (0U)                                                /*!< TPIU_CID0.Preamble Position             */
#define TPIU_CID0_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< TPIU_CID0.Preamble Field                */
/* ------- CID1 Bit Fields                          ------ */
#define TPIU_CID1_Preamble_MASK                  (0xFU)                                              /*!< TPIU_CID1.Preamble Mask                 */
#define TPIU_CID1_Preamble_SHIFT                 (0U)                                                /*!< TPIU_CID1.Preamble Position             */
#define TPIU_CID1_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< TPIU_CID1.Preamble Field                */
#define TPIU_CID1_ComponentClass_MASK            (0xF0U)                                             /*!< TPIU_CID1.ComponentClass Mask           */
#define TPIU_CID1_ComponentClass_SHIFT           (4U)                                                /*!< TPIU_CID1.ComponentClass Position       */
#define TPIU_CID1_ComponentClass(x)              (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< TPIU_CID1.ComponentClass Field          */
/* ------- CID2 Bit Fields                          ------ */
#define TPIU_CID2_Preamble_MASK                  (0xFFU)                                             /*!< TPIU_CID2.Preamble Mask                 */
#define TPIU_CID2_Preamble_SHIFT                 (0U)                                                /*!< TPIU_CID2.Preamble Position             */
